AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
void closeAndDetachZoneServo(int stateIndex) {
  ZoneState& state = zoneStates[stateIndex];
  scheduleServoDetach(stateIndex);
  unsigned long startedAt = millis();
  while (state.servoAttached && millis() - startedAt < SERVO_MOVE_TIMEOUT_MS) {
    updateServoMovements(millis());
    esp_task_wdt_reset();
    delay(5);
  }
  if (state.servoAttached) {
    // Ultimo recurso de seguranca: ordena fechado antes de liberar o PWM antigo.
    state.currentAngle = state.closedAngle;
    if (applyServoAngle(stateIndex, state.currentAngle)) {
      state.appliedState = "CLOSED";
    } else {
      state.appliedState = "UNKNOWN";
    }
    delay(100);
    detachZoneServo(stateIndex);
  }
}

void applyZonesFromConfig() {
  for (int i = 0; i < config.zoneCount; i++) {
    ZoneCfg& zone = config.zones[i];
    if (!zone.hasActuator) {
      continue;
    }

    if (zone.actuator.driver != "ESP32_PWM") {
      Serial.printf("Zona %d ignorada: driver %s nao suportado neste firmware.\n",
        zone.index, zone.actuator.driver.c_str());
      continue;
    }

    int gpio = zone.actuator.channel;
    if (!isServoMappedToZone(zone.index, gpio)) {
      Serial.printf(
        "Saida %d ignorada: servo deve usar GPIO %d, mas recebeu GPIO %d.\n",
        zone.index + 1,
        isValidHaraPortIndex(zone.index) ? SERVO_GPIO_PINS[zone.index] : -1,
        gpio
      );
      continue;
    }
    if (gpioAlreadyUsedInConfig(i, gpio)) {
      Serial.printf("Zona %d ignorada: GPIO %d repetido na configuracao.\n",
        zone.index, gpio);
      continue;
    }

    String targetState = (zone.enabled && zone.desiredState == "OPEN")
      ? "OPEN"
      : "CLOSED";
    int targetAngle = (targetState == "OPEN")
      ? zone.actuator.openAngle
      : zone.actuator.closedAngle;
    int stateIdx = zoneIndexToStateIndex(zone.index);
    if (stateIdx < 0) {
      Serial.printf("Sem espaco de estado para a zona %d.\n", zone.index);
      continue;
    }

    ZoneState& state = zoneStates[stateIdx];
    if (state.servoAttached && state.gpio != gpio) {
      closeAndDetachZoneServo(stateIdx);
    }
    if (!state.servoAttached && !setupZoneServo(stateIdx, zone.actuator)) {
      continue;
    }

    state.closedAngle = constrain(zone.actuator.closedAngle, 0, 180);
    state.minPulseUs = constrain(zone.actuator.minPulseUs, 400, 2999);
    state.maxPulseUs = constrain(zone.actuator.maxPulseUs, state.minPulseUs + 1, 3000);
    state.inverted = zone.actuator.inverted;
    state.targetAngle = constrain(targetAngle, 0, 180);
    state.targetState = targetState;
    state.detachWhenDone = false;
  }

  for (int i = 0; i < zoneStateCount; i++) {
    if (zoneStates[i].servoAttached && !stateHasActiveConfig(zoneStates[i])) {
      scheduleServoDetach(i);
    }
  }
}

void updateServoMovements(unsigned long now) {
  for (int i = 0; i < zoneStateCount; i++) {
    ZoneState& state = zoneStates[i];
    if (!state.servoAttached) {
      continue;
    }

    if (state.currentAngle == state.targetAngle) {
      state.appliedState = state.targetState;
      if (state.detachWhenDone) {
        detachZoneServo(i);
      }
      continue;
    }
    if (now - state.lastMoveAt < SERVO_STEP_INTERVAL_MS) {
      continue;
    }

    state.lastMoveAt = now;
    int delta = state.targetAngle - state.currentAngle;
    int step = constrain(delta, -SERVO_STEP_DEGREES, SERVO_STEP_DEGREES);
    state.currentAngle += step;
    if (!applyServoAngle(i, state.currentAngle)) {
      Serial.printf("Falha ao atualizar PWM da zona %d no GPIO %d.\n",
        state.index, state.gpio);
      lastCommandFailureReason = "Falha ao escrever PWM do servo";
      state.appliedState = "UNKNOWN";
      detachZoneServo(i);
      continue;
    }

    if (state.currentAngle == state.targetAngle) {
      state.appliedState = state.targetState;
      Serial.printf("Zona %d em %s (%d graus, GPIO %d).\n",
        state.index, state.appliedState.c_str(), state.currentAngle, state.gpio);
      if (state.detachWhenDone) {
        detachZoneServo(i);
      }
    }
  }
}

bool waitForZoneMovement(int zoneIndex) {
  int stateIdx = findZoneStateIndex(zoneIndex);
  if (stateIdx < 0 || !zoneStates[stateIdx].servoAttached) {
    lastCommandFailureReason = "Servo da area nao esta configurado";
    Serial.printf("Servo da zona %d nao esta configurado ou conectado ao PWM.\n", zoneIndex);
    return false;
  }

  unsigned long startedAt = millis();
  while (millis() - startedAt < SERVO_MOVE_TIMEOUT_MS) {
    unsigned long now = millis();
    updateServoMovements(now);
    ZoneState& state = zoneStates[stateIdx];
    if (!state.servoAttached) {
      if (lastCommandFailureReason.length() == 0) {
        lastCommandFailureReason = "PWM do servo foi desconectado";
      }
      return false;
    }
    if (state.currentAngle == state.targetAngle &&
        state.appliedState == state.targetState) {
      return true;
    }
    esp_task_wdt_reset();
    delay(5);
  }

  Serial.printf("Timeout ao mover o servo da zona %d.\n", zoneIndex);
  lastCommandFailureReason = "Timeout do movimento do servo";
  return false;
}

bool testZoneServo(int zoneIndex) {
  if (pumpOn) {
    lastCommandFailureReason = "Desligue a bomba antes de testar o servo";
    return false;
  }

  int configIndex = -1;
  for (int i = 0; i < config.zoneCount; i++) {
    if (config.zones[i].index == zoneIndex) {
      configIndex = i;
      break;
    }
  }
  if (configIndex < 0 || !config.zones[configIndex].hasActuator) {
    lastCommandFailureReason = "Area sem servo configurado";
    return false;
  }
  if (config.zones[configIndex].desiredState != "CLOSED") {
    lastCommandFailureReason = "Feche a area antes de testar o servo";
    return false;
  }

  Serial.printf("Teste do servo da zona %d: FECHADO -> ABERTO -> FECHADO.\n", zoneIndex);
  applyZonesFromConfig();
  if (!waitForZoneMovement(zoneIndex)) {
    return false;
  }
  delay(SERVO_ENDPOINT_HOLD_MS);

  config.zones[configIndex].desiredState = "OPEN";
  applyZonesFromConfig();
  if (!waitForZoneMovement(zoneIndex)) {
    config.zones[configIndex].desiredState = "CLOSED";
    applyZonesFromConfig();
    return false;
  }
  delay(SERVO_ENDPOINT_HOLD_MS);

