AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
  config.zones[configIndex].desiredState = "CLOSED";
  applyZonesFromConfig();
  if (!waitForZoneMovement(zoneIndex)) {
    return false;
  }
  delay(SERVO_ENDPOINT_HOLD_MS);
  Serial.printf("Teste do servo da zona %d concluido.\n", zoneIndex);
  return true;
}

void countIrrigationPaths(int& controlledZones, int& openZones) {
  controlledZones = 0;
  openZones = 0;
  for (int i = 0; i < config.zoneCount; i++) {
    ZoneCfg& zone = config.zones[i];
    if (!zone.hasActuator || zone.actuator.driver != "ESP32_PWM" ||
        !isServoMappedToZone(zone.index, zone.actuator.channel)) {
      continue;
    }
    controlledZones++;
    int stateIdx = findZoneStateIndex(zone.index);
    if (stateIdx >= 0 && zoneStates[stateIdx].targetState == "OPEN" &&
        zoneStates[stateIdx].appliedState == "OPEN") {
      openZones++;
    }
  }
}

bool irrigationPathIsSafe() {
  int controlledZones;
  int openZones;
  countIrrigationPaths(controlledZones, openZones);
  if (controlledZones == 0 || openZones == 0) {
    return false;
  }
  return config.maxSimultaneousZones <= 0 ||
    openZones <= config.maxSimultaneousZones;
}

void applyIrrigationControl() {
  if (!hasMoistureReading) {
    setPump(false);
    return;
  }
  if (config.pumpMode == "FORCED_ON") {
    setPump(irrigationPathIsSafe());
    return;
  }
  if (config.pumpMode == "FORCED_OFF") {
    setPump(false);
    return;
  }
  if (config.operationMode == "OFF") {
    bool changed = false;
    for (int i = 0; i < config.zoneCount; i++) {
      if (config.zones[i].desiredState != "CLOSED") {
        config.zones[i].desiredState = "CLOSED";
        changed = true;
      }
    }
    if (changed) {
      applyZonesFromConfig();
    }
    setPump(false);
    return;
  }
  if (config.operationMode != "AUTO") {
    return;
  }

  // Cada area decide pelo proprio sensor e movimenta somente o seu registro.
  bool zoneStateChanged = false;
  for (int i = 0; i < config.zoneCount; i++) {
    ZoneCfg& zone = config.zones[i];
    if (!zone.enabled || !zone.hasActuator ||
        !isServoMappedToZone(zone.index, zone.actuator.channel) ||
        zoneSoilMoisture[zone.index] < 0) {
      continue;
    }

    int moisture = zoneSoilMoisture[zone.index];
    if (moisture < zone.moistureLimit && zone.desiredState != "OPEN") {
      zone.desiredState = "OPEN";
      zoneStateChanged = true;
    } else if (moisture > zone.moistureLimit + MOISTURE_HYSTERESIS &&
               zone.desiredState != "CLOSED") {
      zone.desiredState = "CLOSED";
      zoneStateChanged = true;
    }
  }
  if (zoneStateChanged) {
    applyZonesFromConfig();
  }

  // A bomba so parte depois que pelo menos um registro terminou de abrir.
  setPump(irrigationPathIsSafe());
}

void applyPumpSafety() {
  if (!pumpOn) {
    return;
  }

  int controlledZones;
  int openZones;
  countIrrigationPaths(controlledZones, openZones);

  bool noOpenPath = controlledZones > 0 && openZones == 0;
  bool tooManyOpenZones = config.maxSimultaneousZones > 0 &&
    openZones > config.maxSimultaneousZones;
  if (noOpenPath || tooManyOpenZones) {
    setPump(false);
    if (tooManyOpenZones) {
      Serial.println("Bomba desligada: limite de zonas simultaneas excedido.");
    }
  }
}

// ============================================================
// CONFIGURACAO REMOTA
// ============================================================

bool syncConfigFromApi() {
  if (!hasDeviceCredentials()) {
    return false;
  }
  HTTPClient http;
  String path = "/devices/" + deviceId + "/config";
  if (config.configVersion > 0) {
    path += "?configVersion=" + String(config.configVersion);
  }
  if (!beginHttp(http, path)) {
    lastHttpCode = 0;
    return false;
  }
  addDeviceAuthHeader(http);
  int code = http.GET();
  lastHttpCode = code;
  if (code == 304) {
    http.end();
    if (configLoaded) {
      return true;
    }
    // Nunca aceite 304 sem possuir as areas em RAM; force download completo.
    config.configVersion = 0;
    Serial.println("Config 304 sem cache local; solicitando configuracao completa.");
    return false;
  }
  if (code != 200) {
    Serial.printf("Falha no sync de config. HTTP %d\n", code);
    http.end();
    recoverDeviceRegistration(code, "Config");
    return false;
  }
  String response = http.getString();
  http.end();

  // Check the new standardized response format (success.data) or legacy
  DynamicJsonDocument doc(6144);
  DeserializationError error = deserializeJson(doc, response);
  if (error) {
    Serial.printf("JSON invalido no config: %s\n", error.c_str());
    return false;
  }

  // Handle both new (success.data) and legacy response formats
  JsonObject configData;
  if (doc["success"] == true && !doc["data"].isNull()) {
    configData = doc["data"].as<JsonObject>();
  } else {
    configData = doc.as<JsonObject>();
  }

  if (configData.isNull()) {
    Serial.println("Config: dados nao encontrados na resposta");
    return false;
  }

  config.operationMode = configData["operationMode"] | "AUTO";
  config.moistureLimit = configData["moistureThreshold"] | 35;
  config.heartbeatIntervalSeconds = max(
    1,
    configData["heartbeatIntervalSeconds"] | (int)(HEARTBEAT_INTERVAL_MS / 1000)
  );
  config.telemetryIntervalSeconds = max(
    1,
    configData["telemetryIntervalSeconds"] | (int)(TELEMETRY_INTERVAL_MS / 1000)
  );
  config.configSyncIntervalSeconds = max(
    1,
    configData["configSyncIntervalSeconds"] | (int)(CONFIG_SYNC_INTERVAL_MS / 1000)
  );
  config.pumpMode = configData["pumpMode"] | "AUTO";
  config.maxSimultaneousZones = configData["maxSimultaneousZones"] | 0;
  int newVersion = configData["configVersion"] | 0;
  JsonArray zonesArray = configData["zones"].as<JsonArray>();
  config.zoneCount = min((int)zonesArray.size(), MAX_ZONES);
  for (int i = 0; i < config.zoneCount; i++) {
    JsonObject z = zonesArray[i];
    config.zones[i].index = z["index"] | i;
    config.zones[i].name = z["name"] | "";
    config.zones[i].moistureLimit = constrain(
      z["moistureThreshold"] | config.moistureLimit,
      0,
      100
    );
    config.zones[i].enabled = z["enabled"] | true;
    config.zones[i].desiredState = z["desiredState"] | "CLOSED";
    JsonObject act = z["actuator"];
    if (!act.isNull()) {
      config.zones[i].hasActuator = true;
      config.zones[i].actuator.driver = act["driver"] | "ESP32_PWM";
      config.zones[i].actuator.channel = act["channel"] | 0;
      config.zones[i].actuator.openAngle = act["openAngle"] | 90;
      config.zones[i].actuator.closedAngle = act["closedAngle"] | 10;
      config.zones[i].actuator.minPulseUs = act["minPulseUs"] | 500;
      config.zones[i].actuator.maxPulseUs = act["maxPulseUs"] | 2500;
      config.zones[i].actuator.inverted = act["inverted"] | false;
    } else {
      config.zones[i].hasActuator = false;
    }
  }
  saveConfigVersion(newVersion);
  applyZonesFromConfig();
  configLoaded = true;
  Serial.printf("Config sync OK. Versao %d, %d zonas\n", newVersion, config.zoneCount);
  showStatus("Config OK", String(newVersion) + " v" + String(config.zoneCount) + "z");
  return true;
}

